In [3]:
# 판다스의 자료구조 : 시리즈, 데이터프레임
import pandas as pd

In [4]:
# 시리즈 생성  Series(딕셔너리 또는 리스트, index=[ ])
sr = pd.Series({'a':1, 'b':2, 'c':3})
sr2= pd.Series([1,2,3,4])
print(sr)
print()
print(sr2)

print(type(sr))

a    1
b    2
c    3
dtype: int64

0    1
1    2
2    3
3    4
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
print(sr.index)
print(sr.values)

print(sr[2])

Index(['a', 'b', 'c'], dtype='object')
[1 2 3]
3

In [6]:
data = [[1,2,3,4],[5,6,7,8]]
df=pd.DataFrame(data, index=['a','b'], columns=['c','d','e','f'])
df.columns

Index(['c', 'd', 'e', 'f'], dtype='object')

In [35]:
re = df.rename(columns={'c':'g'})   #c -> g
print(re)
df

   g  d  e  f
a  1  2  3  4
b  5  6  7  8

   c  d  e  f
a  1  2  3  4
b  5  6  7  8

In [106]:
data = {'1조' :['박병화', '유재석', '권순용', '황용운', '조홍근'],
        '2조' :['김선민', '장종욱', '송재연', '김홍재', '최온유'],
        '3조' :['김동빈', '김현중', '심예랑', '정지은', '김선민'],
        '4조' :['김민기', '정희운', '왕희창', '홍성혁', '유지훈']}

df=pd.DataFrame(data)
df

    1조   2조   3조   4조
0  박병화  김선민  김동빈  김민기
1  유재석  장종욱  김현중  정희운
2  권순용  송재연  심예랑  왕희창
3  황용운  김홍재  정지은  홍성혁
4  조홍근  최온유  김선민  유지훈

In [107]:
df['3조'].replace('김선민', '한석준', inplace=True)
df

    1조   2조   3조   4조
0  박병화  김선민  김동빈  김민기
1  유재석  장종욱  김현중  정희운
2  권순용  송재연  심예랑  왕희창
3  황용운  김홍재  정지은  홍성혁
4  조홍근  최온유  한석준  유지훈

In [121]:
exam_data = {'수학' : [ 90, 80, 70, 60, 70], '영어' : [ 98, 89, 95, 100, 96],
             '음악' : [ 85, 95, 100, 50, 80], '체육' : [ 100, 90, 90, 100, 80]}
df_2 = pd.DataFrame(exam_data, index=df['3조'])
df_2

     수학   영어   음악   체육
3조
김동빈  90   98   85  100
김현중  80   89   95   90
심예랑  70   95  100   90
정지은  60  100   50  100
한석준  70   96   80   80

In [123]:
df_2
df_2.iloc[4, :] = 100
df_2

      수학   영어   음악   체육
3조
김동빈   90   98   85  100
김현중   80   89   95   90
심예랑   70   95  100   90
정지은   60  100   50  100
한석준  100  100  100  100

In [117]:
df_2.drop(['심예랑'], inplace=True)
df_2

     수학   영어  음악   체육
3조
김동빈  90   98  85  100
김현중  80   89  95   90
정지은  60  100  50  100
한석준  70   96  80   80